read_verilog top.v 
read_verilog -lib stdcells_S.v 
hierarchy -check -top top
proc; opt; fsm; opt; memory; opt;
techmap; opt
abc -liberty asic_cell_yosys_extended.lib
clean ;;
write_verilog -noattr rpssl_netlist.v